Documents/ДанныеДляРасчетаВЗУП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ДанныеДляРасчетаВЗУП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокументаЗУП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовВводДанныхДляРасчетаЗарплатыЗУП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОтбораСотрудников</Name>
					<Comment>Хранилище значений, в котором хранится настройка отбора</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеДляРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПараметра</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПараметровРасчетаНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательЗУП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиЗУП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПоказателиРасчетаНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/НастройкиПоказателейЗУП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПоказателейЗУП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоказательЗУП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиЗУП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаУчастия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТрудовыеРоли</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПараметра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПараметровРасчетаНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоказательРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоказателиРасчетаНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеПараметра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/НачислениеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>НачислениеЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыССотрудниками</xr:Item>
				<xr:Item>AccumulationRegister.НачисленияСотрудникам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьФиксированныеНачисления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСдельныеНачисления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьПервичныеНачисления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВторичныеНачисления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьНачисленияТретьегоПорядка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьНачисленияЧетвертогоПорядка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОтбораСотрудников</Name>
					<Comment>Хранилище значений, в котором хранится настройка отбора</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоОдномуФилиалу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БазаРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель1</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПараметрНачисленияЗП</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель2</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПараметрНачисленияЗП</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель3</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПараметрНачисленияЗП</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоказателя1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоказателя2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоказателя3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияВыработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТрудоваяРоль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТрудовыеРоли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияВыработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Удержания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияВыработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДанныеДляРасчетаВЗУП/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма, Ложь);
	
		
	ЗаполнитьНачальныеНастройкиОтбора();
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Иначе
		ЗагрузитьСохраненныеНастройкиОтбора();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект,,ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.НастройкаОтбораСотрудников = Новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры

#КонецОбласти

#Область ОтборСотрудников

&НаСервере
Процедура ЗаполнитьНачальныеНастройкиОтбора()
	
	СхемаКомпоновкиДанных = Документы.НачислениеЗарплаты.ПолучитьМакет("СхемаКомпоновкиДанных");
	
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);	
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСохраненныеНастройкиОтбора()
	
	ЗначениеНастроекОтбора = ПолучитьНастройкиОтбора();
	
	Если ТипЗнч(ЗначениеНастроекОтбора) = Тип("НастройкиКомпоновкиДанных") Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(ЗначениеНастроекОтбора);
	КонецЕсли;
	
КонецПроцедуры

// Если в реквизите объекта НастройкаОтбораСотрудников сохранены настройки построителя отчета (которые
// не подходят для компоновщика настроек), то возвращаем настройки компоновщика по умолчанию 
&НаСервере
Функция ПолучитьНастройкиОтбора(ТолькоПроверить = Ложь)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ЗначениеНастроекОтбора = ДокументОбъект.НастройкаОтбораСотрудников.Получить();
	
	Возврат ЗначениеНастроекОтбора;	
		
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ДанныеДляРасчета.Количество() > 0 Тогда
		
		ТекстВопроса = НСтр("ru = 'Таблица с данными расчета будет очищена. Продолжить?'");
		Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да) =
			КодВозвратаДиалога.Нет 
		Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	РассчитатьНаСервере(Команда.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
    Диалог = Новый ДиалогРедактированияСтандартногоПериода();                                 
    Диалог.Период = Новый СтандартныйПериод(Объект.НачалоПериода, Объект.КонецПериода);        
    Если (Диалог.Редактировать()) Тогда
        Объект.НачалоПериода = Диалог.Период.ДатаНачала;
        Объект.КонецПериода = Диалог.Период.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура РассчитатьНаСервере(ИмяКоманды)
	
	Объект.ДанныеДляРасчета.Очистить();
	ТабДанныеДляРасчета = Объект.ДанныеДляРасчета.Выгрузить();
	
	мсСписокСотрудников = Документы.ДанныеДляРасчетаВЗУП.ПолучитьСписокСотрудниковПоОтборам(КомпоновщикНастроек);  
	
	Отбор = Новый Структура;
	Если ИмяКоманды = "ЗаполнитьПоОрганизации" Тогда
		Отбор.Вставить("ИмяРеквизита", "Филиал.Организация");
		Отбор.Вставить("Значение", Объект.Филиал.Организация);	
	ИначеЕсли ИмяКоманды = "ЗаполнитьПоФилиалу" Тогда
		Отбор.Вставить("Значение", Объект.Филиал);
		Отбор.Вставить("ИмяРеквизита", "Филиал");
	Иначе
		Отбор = Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПоказателейЗУП.Сотрудник,
	|	НастройкиПоказателейЗУП.ПоказательЗУП,
	|	НастройкиПоказателейЗУП.ФормаУчастия,
	|	НастройкиПоказателейЗУП.ВидПараметра,
	|	НастройкиПоказателейЗУП.ПоказательРасчета,
	|	НастройкиПоказателейЗУП.ЗначениеПараметра,
	|	НастройкиПоказателейЗУП.ДатаНачала,
	|	НастройкиПоказателейЗУП.ДатаОкончания
	|ИЗ
	|	РегистрСведений.НастройкиПоказателейЗУП КАК НастройкиПоказателейЗУП
	|ГДЕ
	|	НастройкиПоказателейЗУП.ДатаНачала <= &ДатаОкончания
	|	И (НастройкиПоказателейЗУП.ДатаОкончания >= &ДатаНачала
	|			ИЛИ НастройкиПоказателейЗУП.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|	И НастройкиПоказателейЗУП.Сотрудник В(&Сотрудники)
	|	И НастройкиПоказателейЗУП.ПоказательЗУП.ВидДокументаЗУП = &ВидДокументаЗУП";
	
	Запрос.УстановитьПараметр("ДатаНачала", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", Объект.КонецПериода);
	Запрос.УстановитьПараметр("Сотрудники", мсСписокСотрудников);
	Запрос.УстановитьПараметр("ВидДокументаЗУП", Объект.ВидДокументаЗУП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураСотрудник = Новый Структура("Сотрудник, ФормаУчастия, ВидПараметра, ПоказательРасчета, ЗначениеПараметра, ДатаНачала, ДатаОкончания");
		ЗаполнитьЗначенияСвойств(СтруктураСотрудник, Выборка);
		
		СтруктураСотрудник.ДатаНачала = Макс(Выборка.ДатаНачала, Объект.НачалоПериода);
		Если ЗначениеЗаполнено(Выборка.ДатаОкончания) Тогда
			СтруктураСотрудник.ДатаОкончания = Мин(Выборка.ДатаОкончания, Объект.КонецПериода);
		Иначе
			СтруктураСотрудник.ДатаОкончания = Объект.КонецПериода;
		КонецЕсли;
		
		СотрудникСумма = РасчетЗаработнойПлаты.ПолучитьВыработкуНаСотрудника(СтруктураСотрудник, Отбор);
		
		Для Каждого ЗначСуммы Из СотрудникСумма Цикл
			НоваяСтрока = ТабДанныеДляРасчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Значение = ЗначСуммы.Сумма;
		КонецЦикла;
		
	КонецЦикла;
		
	ТабДанныеДляРасчета.Свернуть("Сотрудник, ВидПараметра, ПоказательРасчета, ПоказательЗУП", "Значение");
	Объект.ДанныеДляРасчета.Загрузить(ТабДанныеДляРасчета);
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// )
КонецПроцедуры
